#include <Windows.h>
#include <stdio.h>

void gotoxy(int x, int y)
{
    COORD pos = { x, y };
    HANDLE WConsole = GetStdHandle(STD_OUTPUT_HANDLE);
    SetConsoleCursorPosition(WConsole, pos);
}

void printAsciiArt()
{
    puts("                                            (\033[47m    \033[0m)             ");
    puts("                                            (\033[47m   \033[0m)              ");
    puts("                                           (\033[47m   \033[0m)             ");
    puts("                                           (\033[47m  \033[0m(         /\\");
    puts("                                            )\033[47m  \033[0m)       /  \\  /\\");
    puts("                   _________________________|\033[47m  \033[0m|__    /\\/\\/\\/  \\     ");
    puts("                  /\\\033[41m       ______           |\033[47m  \033[41m|  \033[0m\\  /      \\/\\/\\  ");
    puts("         /\\      /\033[43m/_\033[0m\\\033[41m      \\    /\\          |\033[47m  \033[41m|   \033[0m\\/        \\      ");
    puts("    /\\  /  \\    /\033[43m/___\033[0m\\\033[41m      \\  /\033[43m  \033[41m\\                 \033[0m\\             ");
    puts("   /  \\/    \\  /\033[43m/_____\033[0m\\\033[41m      \\ |\033[44m[]\033[41m|                  \033[0m\\            ");
    puts("  /\\/\\/\\     \\/\033[43m/_______\033[0m\\\033[41m      \\|\033[43m__\033[41m|                   \033[0m\\           ");
    puts(" //     \\    /\033[43m/xxxxxxxxx\033[0m\\\033[41m                              \033[0m\\            ");
    puts("            /\033[43m/_|_|   |_|_\033[0m\\\033[41m______________________________\033[0m\\           ");
    puts("               \033[43m|_|   |_|_------\033[44m[][]\033[43m---------\033[44m[][]\033[43m-----|\033[0m     ");
    puts("               \033[43m|_|___|_|_------\033[44m[][]\033[43m---------\033[44m[][]\033[43m-----|\033[0m                                 ");
    puts("               \033[43m|_|   |_|_----------------------------|\033[0m      ");
    puts("              \033[32m\"____\"  \"_____________________________________\"\033[0m");
}

int main()
{
    printAsciiArt();
    gotoxy(28, 11);
    printf("\033[42m\033[45m나는 잘 시험을 보고있나?\033[0m\n");
    while (1) 
    {
        
            char ch = getch();
            if (ch == 'n' || ch == 'N') 
            {
                gotoxy(0, 20);
                printf("프로그램이 종료됩니다...\n");
                break;
            
            }
            else if (ch == 'y' || ch == 'Y')
            {
                gotoxy(30, 9); 
                int i = 0;
                while(i<5)
                {
                    int j;
                    j = 0;
                    gotoxy(30, 9 + i);
                    while(j<20)
                    {
                        printf("\033[44m ");
                        j++;
                    }
                    printf("\033[0m\n");
                    i++;
                }
                gotoxy(30, 12);
                printf("\033[44m\033[33m 당신 잘 하고 있어!\033[0m");
            }
            else
            {
                gotoxy(30, 17);
                printf("\033[31m다시 입력해주세요!!!\033[0m");
                
            }
    }

    return 0;
}
